//Да се напише програма која ќе го пресмета скаларниот производ на два
//вектори со по n координати. Бројот на координати n, како и координатите на
//векторите се внесуваат од стандарден влез. Резултатот да се испечати на екран.

#include <stdio.h>
int main(){
    int a[100], b[100], scal = 0, i, n;
    scanf("%d", &n);
    for (i = 0; i < n; i++)
        scanf("%d", &a[i]);
    for (i = 0; i < n; i++)
        scanf("%d", &b[i]);
    for (i = 0; i < n; i++)
        scal += a[i] * b[i];
    printf("Scalar = %d", scal);

    return 0;
}